{
   "projects": [
      {
         "title": "Mellofox Branding",
         "thumbnail": "",
         "description": "Melloffox is retro gaming community. They focus on bringing the essence of the retro gaming for the GenZ. Most of the new generation Young Adults have no recollection of the era of fun and chill gaming. Mellofox wants to bring that chill and fun environment for the busy and serious era of eSports.\nHere members get to discuss about the Games and even share their scorecard and have fun while being competitive. From weekly Top Player announcement to In-depth discussion Mellofox wants to be the one place for People to relive the era of fun and carefreeness.",
         "solution": "After going through the brief and research. I created a modern Logo which consist of a logomark which has been made with the letter M and Fox head in mind. For the wordmark I chose a modern sans serif font which not only conveys the playfulness of the brand but also the modified letter F with a fox tail give it a distinctive look. ",
         "testimonial": "This is a concept project",
         "images": [
            {
               "url": "",
               "alt": ""
            },
            {
               "url": "",
               "alt": ""
            }
         ]
      },
      {
         "title": "Hello DryCleano Branding",
         "thumbnail": "",
         "description": "Hello Drycleano is a dry cleaning service. Starting out as a small, family-owned business, Drycleano quickly gained a reputation for its  high-quality cleaning services and exceptional customer service. The founder’s commitment to using environmentally friendly cleaning products and techniques  also set them apart from their competitors.\nAfter using a generic visual identity from its inception the business owner  decided to get a proper identity for their business for better brand recognition  and  effective marketing communication, ensuring continued relevance and resonance  with customers amidst evolving market dynamics, especially the online customers.",
         "solution": "After going through the Client Qustionnaire which I provide during a Project, I completed my market research of same businesses. I found out most of the competetion is using Generic looking rigid wordmarks along with old style icons as their branding whereas the client wanted something opposite. That is why while designing the logo for the brand I focused on the key factors of Drycleano  which are being Friendly, Trustable and giving Ease of Mind to the customers.\nI used a combination logo for the brand which consists a playful wordmark along with  a friendly mascot which is based on the Washing Machine. The color palette is made up of Yellow and Blue to convey the cheerfullness and Trust factor of the brand. WHile using a font pair I used a simple sans serif font to complement the Playfull Logo Font. ",
         "testimonial": "Wow! My new logo is clear, eye-catching, and tells my story at a glance. RDM DZN captured my brand's spirit in a single image. So happy! - Sukhpreet Singh",
         "images": [
            {
               "url": "",
               "alt": ""
            },
            {
               "url": "",
               "alt": ""
            }
         ]
      }
   ]
}